Validation/run1/constant/solidificationProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      solidificationProperties;
}

Tsolid      273.15;                       // [K]
Tliquid     273.65;                       // [K]
Tref        273.15 ;                       // [K]
Treg        275.15;                       // [K]
latentHeat  334e3;                       // [J/kg]

water
{
    rho               1000;
    rhoLiquid         1000;                 // [kg/m^3]
    rhoSolid          900;                 // [kg/m^3]
    cpLiquid          4200;               // [J/(kg*K)]
    cpSolid           2000;               // [J/(kg*K)]


    lambda            0.6;                // [W/(m*K)]
    lambdaSolid       2.21;                // [W/(m*K)]
    lambdaLiquid      0.6;                // [W/(m*K)]
}

contactFluid
{
    rho           1200;                   // [kg/m^3]
    cp            2300;                   // [J/(kg*K)]
    lambda        2.5;                    // [W/(m*K)]
}

air
{
    rho          1.2;                     // [kg/m^3]
    cp           1005;                    // [J/(kg*K)]
    lambda       0.03;                    // [W/(m*K)]
}
heatTransfer
{
    // water - contactFluid
    K_wc    1e7;                          // [W/(m^3*K)]

    // water - air
    K_wa    1.2e6;                          // [W/(m^3*K)]=30 W/(m2*K)

    // contactFluid - air
    K_ca    0;                            // [W/(m^3*K)]
}

