Validation/run1/0_orig/alpha.contactFluid
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha.contactFluid;
}

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    bottom
    {
        type alphaContactAngle;

        contactAngleProperties
        {
            water
            {
                theta0 90;
            }

            air
            {
                theta0 90;
            }
        }

        value uniform 0;
    }

    top    { type zeroGradient; }
    left   { type zeroGradient; }
    right  { type zeroGradient; }
    front  { type empty; }
    back   { type empty; }
}